{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "toc": true
   },
   "source": [
    "<h1>Accompanying Jupyter Notebook for the SWAT4HCLS workshop (Edinburgh, 2019)<span class=\"tocSkip\"></span></h1>\n",
    "<div class=\"toc\"><ul class=\"toc-item\"><li><span><a href=\"#Accompanying-Jupyter-Notebook-for-SWAT4HCLS-workshop-(Edinburgh,-2019).\" data-toc-modified-id=\"Accompanying-Jupyter-Notebook-for-SWAT4HCLS-workshop-(Edinburgh,-2019).-1\"><span class=\"toc-item-num\">1&nbsp;&nbsp;</span>Accompanying Jupyter Notebook for SWAT4HCLS workshop (Edinburgh, 2019).</a></span></li><li><span><a href=\"#Initialisation\" data-toc-modified-id=\"Initialisation-2\"><span class=\"toc-item-num\">2&nbsp;&nbsp;</span>Initialisation</a></span><ul class=\"toc-item\"><li><span><a href=\"#Python-library\" data-toc-modified-id=\"Python-library-2.1\"><span class=\"toc-item-num\">2.1&nbsp;&nbsp;</span>Python library</a></span></li><li><span><a href=\"#SPARQL-endpoint\" data-toc-modified-id=\"SPARQL-endpoint-2.2\"><span class=\"toc-item-num\">2.2&nbsp;&nbsp;</span>SPARQL endpoint</a></span></li><li><span><a href=\"#Python-method\" data-toc-modified-id=\"Python-method-2.3\"><span class=\"toc-item-num\">2.3&nbsp;&nbsp;</span>Python method</a></span></li></ul></li><li><span><a href=\"#SPARQL-query-examples\" data-toc-modified-id=\"SPARQL-query-examples-3\"><span class=\"toc-item-num\">3&nbsp;&nbsp;</span>SPARQL query examples</a></span><ul class=\"toc-item\"><li><span><a href=\"#Q1:-Retrieve-all-Rhea-reactions-(approved-or-preliminary)-and-display-their-chemical-equation\" data-toc-modified-id=\"Q1:-Retrieve-all-Rhea-reactions-(approved-or-preliminary)-and-display-their-chemical-equation-3.1\"><span class=\"toc-item-num\">3.1&nbsp;&nbsp;</span>Q1: Retrieve all Rhea reactions (approved or preliminary) and display their chemical equation</a></span></li><li><span><a href=\"#Q2:-Retrieve-all-approved-reactions-using-L-glutamate-(CHEBI:29985)-AND-L-glutamine-(CHEBI:58359)-in-opposite-reaction-sidesG2:\" data-toc-modified-id=\"Q2:-Retrieve-all-approved-reactions-using-L-glutamate-(CHEBI:29985)-AND-L-glutamine-(CHEBI:58359)-in-opposite-reaction-sidesG2:-3.2\"><span class=\"toc-item-num\">3.2&nbsp;&nbsp;</span>Q2: Retrieve all approved reactions using L-glutamate (CHEBI:29985) AND L-glutamine (CHEBI:58359) in opposite reaction sidesG2:</a></span></li><li><span><a href=\"#Q3:-Select-all-approved-reactions-with-CHEBI:17815-(a-1,2-diacyl-sn-glycerol)-or-one-of-its-descendant.\" data-toc-modified-id=\"Q3:-Select-all-approved-reactions-with-CHEBI:17815-(a-1,2-diacyl-sn-glycerol)-or-one-of-its-descendant.-3.3\"><span class=\"toc-item-num\">3.3&nbsp;&nbsp;</span>Q3: Select all approved reactions with CHEBI:17815 (a 1,2-diacyl-sn-glycerol) or one of its descendant.</a></span></li><li><span><a href=\"#Q4:-Retrieve-Rhea-reactions-that-involve-cholesterol-using-its-InChiKey\" data-toc-modified-id=\"Q4:-Retrieve-Rhea-reactions-that-involve-cholesterol-using-its-InChiKey-3.4\"><span class=\"toc-item-num\">3.4&nbsp;&nbsp;</span>Q4: Retrieve Rhea reactions that involve cholesterol using its InChiKey</a></span></li><li><span><a href=\"#Q5:-Distribution-of-Rhea-reactions-based-on-the-first-level-of-IUBMB-enzyme-classification\" data-toc-modified-id=\"Q5:-Distribution-of-Rhea-reactions-based-on-the-first-level-of-IUBMB-enzyme-classification-3.5\"><span class=\"toc-item-num\">3.5&nbsp;&nbsp;</span>Q5: Distribution of Rhea reactions based on the first level of IUBMB enzyme classification</a></span></li><li><span><a href=\"#Q6:-Retrieve-human-enzymes-(UniProtKB/Swiss-Prot)-and-their-catalyzed-reactions-(Rhea)\" data-toc-modified-id=\"Q6:-Retrieve-human-enzymes-(UniProtKB/Swiss-Prot)-and-their-catalyzed-reactions-(Rhea)-3.6\"><span class=\"toc-item-num\">3.6&nbsp;&nbsp;</span>Q6: Retrieve human enzymes (UniProtKB/Swiss-Prot) and their catalyzed reactions (Rhea)</a></span></li><li><span><a href=\"#Q7:-Ask-if-there-are-fungal-UniProtKB/Swiss-Prot-protein(s)-metabolizing-cholesterol-(for-QC)\" data-toc-modified-id=\"Q7:-Ask-if-there-are-fungal-UniProtKB/Swiss-Prot-protein(s)-metabolizing-cholesterol-(for-QC)-3.7\"><span class=\"toc-item-num\">3.7&nbsp;&nbsp;</span>Q7: Ask if there are fungal UniProtKB/Swiss-Prot protein(s) metabolizing cholesterol (for QC)</a></span></li><li><span><a href=\"#Q8:-Where-are-the-human-enzymes-metabolizing-cholesterol-located-in-the-cell?\" data-toc-modified-id=\"Q8:-Where-are-the-human-enzymes-metabolizing-cholesterol-located-in-the-cell?-3.8\"><span class=\"toc-item-num\">3.8&nbsp;&nbsp;</span>Q8: Where are the human enzymes metabolizing cholesterol located in the cell?</a></span></li><li><span><a href=\"#Q9:-Where-are-the-human-genes-encoding-enzymes-metabolizing-cholesterol-expressed?\" data-toc-modified-id=\"Q9:-Where-are-the-human-genes-encoding-enzymes-metabolizing-cholesterol-expressed?-3.9\"><span class=\"toc-item-num\">3.9&nbsp;&nbsp;</span>Q9: Where are the human genes encoding enzymes metabolizing cholesterol expressed?</a></span></li><li><span><a href=\"#Q10:-Build-the-UniProt-H.-pylori-proteome-scale-metabolic-network\" data-toc-modified-id=\"Q10:-Build-the-UniProt-H.-pylori-proteome-scale-metabolic-network-3.10\"><span class=\"toc-item-num\">3.10&nbsp;&nbsp;</span>Q10: Build the UniProt H. pylori proteome scale metabolic network</a></span></li><li><span><a href=\"#Q11:-Explore-H.-pylori-tryptophan-biosynthesis-pathway-(GO:0000162)\" data-toc-modified-id=\"Q11:-Explore-H.-pylori-tryptophan-biosynthesis-pathway-(GO:0000162)-3.11\"><span class=\"toc-item-num\">3.11&nbsp;&nbsp;</span>Q11: Explore H. pylori tryptophan biosynthesis pathway (GO:0000162)</a></span></li><li><span><a href=\"#Q12:-H.-pylori-enzyme-complexes-for-tryptophan-biosynthesis-pathway-(MetaNetX:-seed_Opt85962_1)\" data-toc-modified-id=\"Q12:-H.-pylori-enzyme-complexes-for-tryptophan-biosynthesis-pathway-(MetaNetX:-seed_Opt85962_1)-3.12\"><span class=\"toc-item-num\">3.12&nbsp;&nbsp;</span>Q12: H. pylori enzyme complexes for tryptophan biosynthesis pathway (MetaNetX: seed_Opt85962_1)</a></span></li></ul></li><li><span><a href=\"#Visualization\" data-toc-modified-id=\"Visualization-4\"><span class=\"toc-item-num\">4&nbsp;&nbsp;</span>Visualization</a></span><ul class=\"toc-item\"><li><span><a href=\"#Venn-diagram-showing-the-taxonomic-distribution-of-Rhea-reactions-annotated-in-UniProtKB/Swiss-Prot-(UniProtKB/Swiss-Prot)\" data-toc-modified-id=\"Venn-diagram-showing-the-taxonomic-distribution-of-Rhea-reactions-annotated-in-UniProtKB/Swiss-Prot-(UniProtKB/Swiss-Prot)-4.1\"><span class=\"toc-item-num\">4.1&nbsp;&nbsp;</span>Venn diagram showing the taxonomic distribution of Rhea reactions annotated in UniProtKB/Swiss-Prot (UniProtKB/Swiss-Prot)</a></span><ul class=\"toc-item\"><li><span><a href=\"#Q20:-Retrieve-UniProtKB/Swiss-Prot-proteins,-their-taxonomic-domain-and-their-catalyzed-Rhea-reactions\" data-toc-modified-id=\"Q20:-Retrieve-UniProtKB/Swiss-Prot-proteins,-their-taxonomic-domain-and-their-catalyzed-Rhea-reactions-4.1.1\"><span class=\"toc-item-num\">4.1.1&nbsp;&nbsp;</span>Q20: Retrieve UniProtKB/Swiss-Prot proteins, their taxonomic domain and their catalyzed Rhea reactions</a></span></li><li><span><a href=\"#Compute-Venn-diagram-using-matplotlib-and-matplotlib_venn-python-libraries\" data-toc-modified-id=\"Compute-Venn-diagram-using-matplotlib-and-matplotlib_venn-python-libraries-4.1.2\"><span class=\"toc-item-num\">4.1.2&nbsp;&nbsp;</span>Compute Venn diagram using matplotlib and matplotlib_venn python libraries</a></span></li></ul></li></ul></li></ul></div>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Accompanying Jupyter Notebook for SWAT4HCLS workshop (Edinburgh, 2019).\n",
    "\n",
    "This notebook is an hands-on introduction to querying metabolism related data across multiple data sources using SPARQL.\n",
    "\n",
    "|Source | Description | web site | SPAQRL endpoint | \n",
    "|-------|-------------|----------|-----------------|\n",
    "| Rhea | chemical reactions | https://www.rhea-db.org/ | https://sparql.uniprot.org/sparql/ |\n",
    "| UniProt | protein sequences and annotations | https://www.uniprot.org/ |https://sparql.rhea-db.org/sparql |\n",
    "| Bgee | expression data |https://bgee.org/ | hosted by http://biosoda.expasy.org/ |\n",
    "| MetaNetX | reconcilied metabolic networks | https://www.metanetx.org/ | https://rdf.metanetx.org/|\n",
    "| bioSODA | Bio-Query: Federated template search over biological databases | |http://biosoda.expasy.org/|\n",
    "\n",
    "This notebook is built with a **Python3 kernel** and uses the **SPARQLWrapper** and **pandas** python libraries.\n",
    "\n",
    "**Note that you can simply use this notebook as a library of SPARQL queries.**  \n",
    "Each query starts with a comment line (#) indicating the SPARQL endpoint to be used to run the query.  \n",
    "\n",
    "Example: Q1 query  \n",
    "\\#endpoint: https://sparql.rhea-db.org/sparql  \n",
    "Go to https://sparql.rhea-db.org/sparql and copy/paste Q1 query in the query form."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Initialisation\n",
    "This notebook use a Python3 kernel."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Python library"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas as pd\n",
    "from pandas.io.json import json_normalize"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## SPARQL endpoint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql_uniprot_url = \"https://sparql.uniprot.org/sparql/\"\n",
    "sparql_rhea_url = \"https://sparql.rhea-db.org/sparql\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Python method"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def sparql2pandas(sparql_query, sparql_service_url):\n",
    "    \"\"\"\n",
    "    Use SPARQLWrapper to query a SPARQL endpoint (sparql_service_url) with a given SPARQL query string \n",
    "    (sparql_query) that uses SELECT query form.\n",
    "    Return the result as a pandas Dataframe.\n",
    "    \"\"\"\n",
    "    #\n",
    "    # run the SPARQL query\n",
    "    #\n",
    "    sparql=SPARQLWrapper(sparql_service_url)    \n",
    "    sparql.setQuery(sparql_query)\n",
    "    sparql.setReturnFormat(JSON)    \n",
    "    res = sparql.query().convert()\n",
    "    \n",
    "    # convert the JSON result (res) in a pandas dataframe\n",
    "    res_sparql_df = json_normalize(res[\"results\"][\"bindings\"])\n",
    "    \n",
    "    # distinguish .type and .value\n",
    "    col_type = [c for c in res_sparql_df.columns.tolist() if \".type\" in c]\n",
    "    col_value = [c for c in res_sparql_df.columns.tolist() if \".value\" in c]\n",
    "    col_datatype = [c for c in res_sparql_df.columns.tolist() if \".datatype\" in c]\n",
    "    \n",
    "    # Remove .type columns\n",
    "    res_sparql_df.drop(col_type,axis=1,inplace=True)\n",
    "    # Remove .datatype columns\n",
    "    res_sparql_df.drop(col_datatype,axis=1,inplace=True)    \n",
    "    # Remove \".value\" from column names\n",
    "    res_sparql_df = res_sparql_df.rename(columns = lambda col: col.replace(\".value\", \"\"))\n",
    "    \n",
    "    return res_sparql_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "reaction http://rdf.rhea-db.org/10000 uri\n",
      "reactionEquation H2O + pentanamide = NH4(+) + pentanoate literal\n",
      "reaction http://rdf.rhea-db.org/10004 uri\n",
      "reactionEquation benzyl isothiocyanate = benzyl thiocyanate literal\n"
     ]
    }
   ],
   "source": [
    "sparql = SPARQLWrapper(sparql_rhea_url)\n",
    "\n",
    "query=\"\"\"#endpoint: https://sparql.rhea-db.org/sparql\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "SELECT ?reaction ?reactionEquation \n",
    "WHERE {\n",
    "  ?reaction rdfs:subClassOf rh:Reaction .\n",
    "  ?reaction rh:status ?status .\n",
    "  VALUES ?status {rh:Approved rh:Preliminary}\n",
    "  ?reaction rh:equation ?reactionEquation .\n",
    "}\n",
    "ORDER BY ?reaction\n",
    "LIMIT 2\"\"\"\n",
    "\n",
    "sparql.setQuery(query)\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    for key in result.keys():\n",
    "        print(key,result[key]['value'],result[key]['type'],)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# SPARQL query examples"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q1: Retrieve all Rhea reactions (approved or preliminary) and display their chemical equation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint: https://sparql.rhea-db.org/sparql\n",
      "\n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "\n",
      "SELECT ?reaction ?reactionEquation \n",
      "WHERE {\n",
      "  ?reaction rdfs:subClassOf rh:Reaction .\n",
      "  ?reaction rh:status ?status .\n",
      "  VALUES ?status {rh:Approved rh:Preliminary}\n",
      "  ?reaction rh:equation ?reactionEquation .\n",
      "}\n",
      "ORDER BY ?reaction\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql_Q1=\"\"\"\n",
    "#endpoint: https://sparql.rhea-db.org/sparql\n",
    "\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "\n",
    "SELECT ?reaction ?reactionEquation \n",
    "WHERE {\n",
    "  ?reaction rdfs:subClassOf rh:Reaction .\n",
    "  ?reaction rh:status ?status .\n",
    "  VALUES ?status {rh:Approved rh:Preliminary}\n",
    "  ?reaction rh:equation ?reactionEquation .\n",
    "}\n",
    "ORDER BY ?reaction\n",
    "\"\"\"\n",
    "print(sparql_Q1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>reaction</th>\n",
       "      <th>reactionEquation</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://rdf.rhea-db.org/10000</td>\n",
       "      <td>H2O + pentanamide = NH4(+) + pentanoate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://rdf.rhea-db.org/10004</td>\n",
       "      <td>benzyl isothiocyanate = benzyl thiocyanate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://rdf.rhea-db.org/10008</td>\n",
       "      <td>[protein]-dithiol + a hydroperoxide = [protein...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://rdf.rhea-db.org/10012</td>\n",
       "      <td>(R)-6-hydroxynicotine + H2O + O2 = 6-hydroxyps...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://rdf.rhea-db.org/10016</td>\n",
       "      <td>H2O + O-sinapoylcholine = choline + H(+) + tra...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       reaction  \\\n",
       "0  http://rdf.rhea-db.org/10000   \n",
       "1  http://rdf.rhea-db.org/10004   \n",
       "2  http://rdf.rhea-db.org/10008   \n",
       "3  http://rdf.rhea-db.org/10012   \n",
       "4  http://rdf.rhea-db.org/10016   \n",
       "\n",
       "                                    reactionEquation  \n",
       "0            H2O + pentanamide = NH4(+) + pentanoate  \n",
       "1         benzyl isothiocyanate = benzyl thiocyanate  \n",
       "2  [protein]-dithiol + a hydroperoxide = [protein...  \n",
       "3  (R)-6-hydroxynicotine + H2O + O2 = 6-hydroxyps...  \n",
       "4  H2O + O-sinapoylcholine = choline + H(+) + tra...  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Execute sparql_Q1\n",
    "try:\n",
    "    df  = sparql2pandas(sparql_Q1,sparql_rhea_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q1')\n",
    "\n",
    "# Display the 5 first rows\n",
    "df.head(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q2: Retrieve all approved reactions using L-glutamate (CHEBI:29985) AND L-glutamine (CHEBI:58359) in opposite reaction sidesG2: "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint:https://sparql.rhea-db.org/sparql\n",
      "\n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "PREFIX ch:<http://purl.obolibrary.org/obo/>\n",
      "\n",
      "SELECT ?reaction \n",
      "WHERE {\n",
      "  ?reaction rdfs:subClassOf rh:Reaction .\n",
      "  ?reaction rh:status rh:Approved .\n",
      "\n",
      "  ?reaction rh:side ?reactionSide1 .\n",
      "  ?reactionSide1 rh:contains ?participant1 .\n",
      "  ?participant1 rh:compound ?compound1 .\n",
      "  ?compound1 rh:chebi ch:CHEBI_29985 .\n",
      "\n",
      "  ?reaction rh:side ?reactionSide2 .\n",
      "  ?reactionSide2 rh:contains ?participant2 .\n",
      "  ?participant2 rh:compound ?compound2 .\n",
      "  ?compound2 rh:chebi ch:CHEBI_58359 .\n",
      "\n",
      "  ?reactionSide1 rh:transformableTo ?reactionSide2 .\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "sparql_Q2=\"\"\"\n",
    "#endpoint:https://sparql.rhea-db.org/sparql\n",
    "\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "PREFIX ch:<http://purl.obolibrary.org/obo/>\n",
    "\n",
    "SELECT ?reaction  ",
    "WHERE {\n",
    "  ?reaction rdfs:subClassOf rh:Reaction .\n",
    "  ?reaction rh:status rh:Approved .\n",
    "\n",
    "  ?reaction rh:side ?reactionSide1 .\n",
    "  ?reactionSide1 rh:contains ?participant1 .\n",
    "  ?participant1 rh:compound ?compound1 .\n",
    "  ?compound1 rh:chebi ch:CHEBI_29985 .\n",
    "\n",
    "  ?reaction rh:side ?reactionSide2 .\n",
    "  ?reactionSide2 rh:contains ?participant2 .\n",
    "  ?participant2 rh:compound ?compound2 .\n",
    "  ?compound2 rh:chebi ch:CHEBI_58359 .\n",
    "\n",
    "  ?reactionSide1 rh:transformableTo ?reactionSide2 .\n",
    "}\"\"\"\n",
    "\n",
    "print(sparql_Q2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>reaction</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://rdf.rhea-db.org/21732</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://rdf.rhea-db.org/23256</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://rdf.rhea-db.org/24384</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://rdf.rhea-db.org/24793</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://rdf.rhea-db.org/25512</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       reaction\n",
       "0  http://rdf.rhea-db.org/21732\n",
       "1  http://rdf.rhea-db.org/23256\n",
       "2  http://rdf.rhea-db.org/24384\n",
       "3  http://rdf.rhea-db.org/24793\n",
       "4  http://rdf.rhea-db.org/25512"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df  = sparql2pandas(sparql_Q2,sparql_rhea_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q2')\n",
    "    stop\n",
    "\n",
    "# Display the 5 first rows\n",
    "df.head(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q3: Select all approved reactions with CHEBI:17815 (a 1,2-diacyl-sn-glycerol) or one of its descendant."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint:https://sparql.rhea-db.org/sparql\n",
      "\n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "PREFIX ch:<http://purl.obolibrary.org/obo/>\n",
      "PREFIX up:<http://purl.uniprot.org/core/>\n",
      "\n",
      "SELECT distinct ?chebi ?chebiUniprotName ?reaction ?reactionEquation \n",
      "WHERE {\n",
      "  ?reaction rdfs:subClassOf rh:Reaction .\n",
      "  ?reaction rh:status rh:Approved .\n",
      "  ?reaction rh:equation ?reactionEquation .\n",
      "  ?reaction rh:side ?reactionSide .\n",
      "  ?reactionSide rh:contains ?participant .\n",
      "  ?participant rh:compound ?compound .\n",
      "  ?compound rh:chebi ?chebi .\n",
      "  ?chebi rdfs:subClassOf* ch:CHEBI_17815 .\n",
      "  ?chebi up:name ?chebiUniprotName .\n",
      "}\n",
      "ORDER BY ?chebi\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql_Q3=\"\"\"\n",
    "#endpoint:https://sparql.rhea-db.org/sparql\n",
    "\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "PREFIX ch:<http://purl.obolibrary.org/obo/>\n",
    "PREFIX up:<http://purl.uniprot.org/core/>\n",
    "\n",
    "SELECT distinct ?chebi ?chebiUniprotName ?reaction ?reactionEquation \n",
    "WHERE {\n",
    "  ?reaction rdfs:subClassOf rh:Reaction .\n",
    "  ?reaction rh:status rh:Approved .\n",
    "  ?reaction rh:equation ?reactionEquation .\n",
    "  ?reaction rh:side ?reactionSide .\n",
    "  ?reactionSide rh:contains ?participant .\n",
    "  ?participant rh:compound ?compound .\n",
    "  ?compound rh:chebi ?chebi .\n",
    "  ?chebi rdfs:subClassOf* ch:CHEBI_17815 .\n",
    "  ?chebi up:name ?chebiUniprotName .\n",
    "}\n",
    "ORDER BY ?chebi\n",
    "\"\"\"\n",
    "print(sparql_Q3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>chebi</th>\n",
       "      <th>chebiUniprotName</th>\n",
       "      <th>reaction</th>\n",
       "      <th>reactionEquation</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_140452</td>\n",
       "      <td>1-O-(1Z-octadecenoyl)-2-(9Z-octadecenoyl)-sn-g...</td>\n",
       "      <td>http://rdf.rhea-db.org/56464</td>\n",
       "      <td>1-O-(1Z-octadecenoyl)-2-(9Z-octadecenoyl)-sn-g...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_140526</td>\n",
       "      <td>1,2-dihexanoyl-sn-glycerol</td>\n",
       "      <td>http://rdf.rhea-db.org/56540</td>\n",
       "      <td>(9Z)-octadecenoyl-CoA + 1,2-dihexanoyl-sn-glyc...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_17815</td>\n",
       "      <td>a 1,2-diacyl-sn-glycerol</td>\n",
       "      <td>http://rdf.rhea-db.org/55608</td>\n",
       "      <td>a 1,2-diacyl-sn-glycero-3-phospho-(1D-myo-inos...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_17815</td>\n",
       "      <td>a 1,2-diacyl-sn-glycerol</td>\n",
       "      <td>http://rdf.rhea-db.org/24698</td>\n",
       "      <td>a 1,2-diacyl-sn-glycero-3-phosphoethanolamine ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_17815</td>\n",
       "      <td>a 1,2-diacyl-sn-glycerol</td>\n",
       "      <td>http://rdf.rhea-db.org/25948</td>\n",
       "      <td>a 1,2-diacyl-sn-glycerol + CTP = a 1,2-diacyl-...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         chebi  \\\n",
       "0  http://purl.obolibrary.org/obo/CHEBI_140452   \n",
       "1  http://purl.obolibrary.org/obo/CHEBI_140526   \n",
       "2   http://purl.obolibrary.org/obo/CHEBI_17815   \n",
       "3   http://purl.obolibrary.org/obo/CHEBI_17815   \n",
       "4   http://purl.obolibrary.org/obo/CHEBI_17815   \n",
       "\n",
       "                                    chebiUniprotName  \\\n",
       "0  1-O-(1Z-octadecenoyl)-2-(9Z-octadecenoyl)-sn-g...   \n",
       "1                         1,2-dihexanoyl-sn-glycerol   \n",
       "2                           a 1,2-diacyl-sn-glycerol   \n",
       "3                           a 1,2-diacyl-sn-glycerol   \n",
       "4                           a 1,2-diacyl-sn-glycerol   \n",
       "\n",
       "                       reaction  \\\n",
       "0  http://rdf.rhea-db.org/56464   \n",
       "1  http://rdf.rhea-db.org/56540   \n",
       "2  http://rdf.rhea-db.org/55608   \n",
       "3  http://rdf.rhea-db.org/24698   \n",
       "4  http://rdf.rhea-db.org/25948   \n",
       "\n",
       "                                    reactionEquation  \n",
       "0  1-O-(1Z-octadecenoyl)-2-(9Z-octadecenoyl)-sn-g...  \n",
       "1  (9Z)-octadecenoyl-CoA + 1,2-dihexanoyl-sn-glyc...  \n",
       "2  a 1,2-diacyl-sn-glycero-3-phospho-(1D-myo-inos...  \n",
       "3  a 1,2-diacyl-sn-glycero-3-phosphoethanolamine ...  \n",
       "4  a 1,2-diacyl-sn-glycerol + CTP = a 1,2-diacyl-...  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df  = sparql2pandas(sparql_Q3,sparql_rhea_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q3')\n",
    "    stop\n",
    "    \n",
    "# Display the 5 first rows\n",
    "df.head(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q4: Retrieve Rhea reactions that involve cholesterol using its InChiKey"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint:https://sparql.rhea-db.org/sparql\n",
      "\n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "PREFIX ch:<http://purl.obolibrary.org/obo/>\n",
      "PREFIX ch3:<http://purl.obolibrary.org/obo/chebi/> \n",
      "PREFIX up:<http://purl.uniprot.org/core/>\n",
      "\n",
      "SELECT distinct ?chebi \n",
      "                ?chebiUniprotName \n",
      "                ?reaction \n",
      "                ?reactionEquation \n",
      "WHERE {\n",
      "  ?reaction rdfs:subClassOf rh:Reaction .\n",
      "  ?reaction rh:status ?status .\n",
      "  VALUES (?status) {(rh:Approved) (rh:Preliminary)}\n",
      "  ?reaction rh:equation ?reactionEquation .\n",
      "  ?reaction rh:side ?reactionSide .\n",
      "  ?reactionSide rh:contains ?participant .\n",
      "  ?participant rh:compound ?compound .\n",
      "  ?compound rh:chebi ?chebi .\n",
      "  ?chebi up:name ?chebiUniprotName .\n",
      "  ?chebi ch3:inchikey ?inchikey .\n",
      "  VALUES (?inchikey) {(\"HVYWMOMLDIMFJA-DPAQBDIFSA-N\")}\n",
      "}\n",
      "ORDER BY ?reaction\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql_Q4=\"\"\"\n",
    "#endpoint:https://sparql.rhea-db.org/sparql\n",
    "\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "PREFIX ch:<http://purl.obolibrary.org/obo/>\n",
    "PREFIX ch3:<http://purl.obolibrary.org/obo/chebi/> \n",
    "PREFIX up:<http://purl.uniprot.org/core/>\n",
    "\n",
    "SELECT distinct ?chebi \n",
    "                ?chebiUniprotName \n",
    "                ?reaction \n",
    "                ?reactionEquation \n",
    "WHERE {\n",
    "  ?reaction rdfs:subClassOf rh:Reaction .\n",
    "  ?reaction rh:status ?status .\n",
    "  VALUES (?status) {(rh:Approved) (rh:Preliminary)}\n",
    "  ?reaction rh:equation ?reactionEquation .\n",
    "  ?reaction rh:side ?reactionSide .\n",
    "  ?reactionSide rh:contains ?participant .\n",
    "  ?participant rh:compound ?compound .\n",
    "  ?compound rh:chebi ?chebi .\n",
    "  ?chebi up:name ?chebiUniprotName .\n",
    "  ?chebi ch3:inchikey ?inchikey .\n",
    "  VALUES (?inchikey) {(\"HVYWMOMLDIMFJA-DPAQBDIFSA-N\")}\n",
    "}\n",
    "ORDER BY ?reaction\n",
    "\"\"\"\n",
    "\n",
    "print(sparql_Q4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>chebi</th>\n",
       "      <th>chebiUniprotName</th>\n",
       "      <th>reaction</th>\n",
       "      <th>reactionEquation</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_16113</td>\n",
       "      <td>cholesterol</td>\n",
       "      <td>http://rdf.rhea-db.org/11956</td>\n",
       "      <td>cholesteryl-beta-D-glucoside + H2O = cholester...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_16113</td>\n",
       "      <td>cholesterol</td>\n",
       "      <td>http://rdf.rhea-db.org/17729</td>\n",
       "      <td>an acyl-CoA + cholesterol = a cholesterol este...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_16113</td>\n",
       "      <td>cholesterol</td>\n",
       "      <td>http://rdf.rhea-db.org/21104</td>\n",
       "      <td>AH2 + cholesterol + O2 = 25-hydroxycholesterol...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_16113</td>\n",
       "      <td>cholesterol</td>\n",
       "      <td>http://rdf.rhea-db.org/21328</td>\n",
       "      <td>cholesterol + O2 = cholest-4-en-3-one + H2O2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_16113</td>\n",
       "      <td>cholesterol</td>\n",
       "      <td>http://rdf.rhea-db.org/21812</td>\n",
       "      <td>cholesterol + O2 + reduced [NADPH--hemoprotein...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        chebi chebiUniprotName  \\\n",
       "0  http://purl.obolibrary.org/obo/CHEBI_16113      cholesterol   \n",
       "1  http://purl.obolibrary.org/obo/CHEBI_16113      cholesterol   \n",
       "2  http://purl.obolibrary.org/obo/CHEBI_16113      cholesterol   \n",
       "3  http://purl.obolibrary.org/obo/CHEBI_16113      cholesterol   \n",
       "4  http://purl.obolibrary.org/obo/CHEBI_16113      cholesterol   \n",
       "\n",
       "                       reaction  \\\n",
       "0  http://rdf.rhea-db.org/11956   \n",
       "1  http://rdf.rhea-db.org/17729   \n",
       "2  http://rdf.rhea-db.org/21104   \n",
       "3  http://rdf.rhea-db.org/21328   \n",
       "4  http://rdf.rhea-db.org/21812   \n",
       "\n",
       "                                    reactionEquation  \n",
       "0  cholesteryl-beta-D-glucoside + H2O = cholester...  \n",
       "1  an acyl-CoA + cholesterol = a cholesterol este...  \n",
       "2  AH2 + cholesterol + O2 = 25-hydroxycholesterol...  \n",
       "3       cholesterol + O2 = cholest-4-en-3-one + H2O2  \n",
       "4  cholesterol + O2 + reduced [NADPH--hemoprotein...  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df  = sparql2pandas(sparql_Q4,sparql_rhea_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q4')\n",
    "    stop\n",
    "    \n",
    "# Display the 5 first rows\n",
    "df.head(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q5: Distribution of Rhea reactions based on the first level of IUBMB enzyme classification"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint:https://sparql.rhea-db.org/sparql\n",
      "\n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "PREFIX ec:<http://purl.uniprot.org/enzyme/>\n",
      "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX skos:<http://www.w3.org/2004/02/skos/core#> \n",
      "\n",
      "SELECT ?ecClass \n",
      "       ?ecClassName\n",
      "       (count(?reaction) as ?reactionCount)\n",
      "WHERE\n",
      "{\n",
      "  SERVICE <http://sparql.uniprot.org/sparql> {\n",
      "    ?ec rdfs:subClassOf ?ecClass .\n",
      "    ?ecClass skos:prefLabel ?ecClassName .\n",
      "    VALUES (?ecClass) { (ec:1.-.-.-) (ec:2.-.-.-)(ec:3.-.-.-)\n",
      "                        (ec:4.-.-.-)(ec:5.-.-.-) (ec:6.-.-.-) \n",
      "                        (ec:7.-.-.-) }\n",
      "  }\n",
      "  ?reaction rh:ec ?ec .\n",
      "}\n",
      "ORDER BY ?ecClass\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql_Q5=\"\"\"\n",
    "#endpoint:https://sparql.rhea-db.org/sparql\n",
    "\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "PREFIX ec:<http://purl.uniprot.org/enzyme/>\n",
    "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos:<http://www.w3.org/2004/02/skos/core#> \n",
    "\n",
    "SELECT ?ecClass \n",
    "       ?ecClassName\n",
    "       (count(?reaction) as ?reactionCount)\n",
    "WHERE\n",
    "{\n",
    "  SERVICE <http://sparql.uniprot.org/sparql> {\n",
    "    ?ec rdfs:subClassOf ?ecClass .\n",
    "    ?ecClass skos:prefLabel ?ecClassName .\n",
    "    VALUES (?ecClass) { (ec:1.-.-.-) (ec:2.-.-.-)(ec:3.-.-.-)\n",
    "                        (ec:4.-.-.-)(ec:5.-.-.-) (ec:6.-.-.-) \n",
    "                        (ec:7.-.-.-) }\n",
    "  }\n",
    "  ?reaction rh:ec ?ec .\n",
    "}\n",
    "ORDER BY ?ecClass\n",
    "\"\"\"\n",
    "print(sparql_Q5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ecClass</th>\n",
       "      <th>ecClassName</th>\n",
       "      <th>reactionCount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.uniprot.org/enzyme/1.-.-.-</td>\n",
       "      <td>Oxidoreductases</td>\n",
       "      <td>2445</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.uniprot.org/enzyme/2.-.-.-</td>\n",
       "      <td>Transferases</td>\n",
       "      <td>2218</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.uniprot.org/enzyme/3.-.-.-</td>\n",
       "      <td>Hydrolases</td>\n",
       "      <td>909</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.uniprot.org/enzyme/4.-.-.-</td>\n",
       "      <td>Lyases</td>\n",
       "      <td>760</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.uniprot.org/enzyme/5.-.-.-</td>\n",
       "      <td>Isomerases</td>\n",
       "      <td>322</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.uniprot.org/enzyme/6.-.-.-</td>\n",
       "      <td>Ligases</td>\n",
       "      <td>224</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.uniprot.org/enzyme/7.-.-.-</td>\n",
       "      <td>Translocases</td>\n",
       "      <td>76</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  ecClass      ecClassName reactionCount\n",
       "0  http://purl.uniprot.org/enzyme/1.-.-.-  Oxidoreductases          2445\n",
       "1  http://purl.uniprot.org/enzyme/2.-.-.-     Transferases          2218\n",
       "2  http://purl.uniprot.org/enzyme/3.-.-.-       Hydrolases           909\n",
       "3  http://purl.uniprot.org/enzyme/4.-.-.-           Lyases           760\n",
       "4  http://purl.uniprot.org/enzyme/5.-.-.-       Isomerases           322\n",
       "5  http://purl.uniprot.org/enzyme/6.-.-.-          Ligases           224\n",
       "6  http://purl.uniprot.org/enzyme/7.-.-.-     Translocases            76"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df  = sparql2pandas(sparql_Q5,sparql_rhea_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q5')\n",
    "    stop\n",
    "    \n",
    "# Display all result (7 IUBMB enzyme classes)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q6: Retrieve human enzymes (UniProtKB/Swiss-Prot) and their catalyzed reactions (Rhea)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint:https://sparql.rhea-db.org/sparql\n",
      "\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX up: <http://purl.uniprot.org/core/>\n",
      "PREFIX rh: <http://rdf.rhea-db.org/>\n",
      "PREFIX taxon:<http://purl.uniprot.org/taxonomy/> \n",
      "\n",
      "SELECT DISTINCT ?protein  \n",
      "                ?reaction \n",
      "                ?reactionEquation \n",
      "WHERE {\n",
      "  SERVICE <https://sparql.uniprot.org/sparql/> {\n",
      "    ?protein up:reviewed true .\n",
      "    # HUMAN proteins (taxid=9606)\n",
      "    ?protein up:organism taxon:9606 .\n",
      "    ?protein up:annotation ?a .\n",
      "    ?a a up:Catalytic_Activity_Annotation .\n",
      "    ?a up:catalyticActivity ?ca .\n",
      "    ?ca up:catalyzedReaction ?reaction .  \n",
      "  }\n",
      "  ?reaction rh:equation ?reactionEquation .\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "sparql_Q6=\"\"\"\n",
    "#endpoint:https://sparql.rhea-db.org/sparql\n",
    "\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX up: <http://purl.uniprot.org/core/>\n",
    "PREFIX rh: <http://rdf.rhea-db.org/>\n",
    "PREFIX taxon:<http://purl.uniprot.org/taxonomy/> \n",
    "\n",
    "SELECT DISTINCT ?protein  \n",
    "                ?reaction \n",
    "                ?reactionEquation \n",
    "WHERE {\n",
    "  SERVICE <https://sparql.uniprot.org/sparql/> {\n",
    "    ?protein up:reviewed true .\n",
    "    # HUMAN proteins (taxid=9606)\n",
    "    ?protein up:organism taxon:9606 .\n",
    "    ?protein up:annotation ?a .\n",
    "    ?a a up:Catalytic_Activity_Annotation .\n",
    "    ?a up:catalyticActivity ?ca .\n",
    "    ?ca up:catalyzedReaction ?reaction .  \n",
    "  }\n",
    "  ?reaction rh:equation ?reactionEquation .\n",
    "}\"\"\"\n",
    "\n",
    "print(sparql_Q6)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>protein</th>\n",
       "      <th>reaction</th>\n",
       "      <th>reactionEquation</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q8WUI4</td>\n",
       "      <td>http://rdf.rhea-db.org/58196</td>\n",
       "      <td>H2O + N(6)-acetyl-L-lysyl-[histone] = acetate ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q8N5Y8</td>\n",
       "      <td>http://rdf.rhea-db.org/58220</td>\n",
       "      <td>L-lysyl-[protein] + NAD(+) = H(+) + N(6)-(ADP-...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q460N5</td>\n",
       "      <td>http://rdf.rhea-db.org/58224</td>\n",
       "      <td>L-glutamyl-[protein] + NAD(+) = 5-O-(ADP-D-rib...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q8N5Y8</td>\n",
       "      <td>http://rdf.rhea-db.org/58224</td>\n",
       "      <td>L-glutamyl-[protein] + NAD(+) = 5-O-(ADP-D-rib...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q9UKK3</td>\n",
       "      <td>http://rdf.rhea-db.org/58224</td>\n",
       "      <td>L-glutamyl-[protein] + NAD(+) = 5-O-(ADP-D-rib...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  protein                      reaction  \\\n",
       "0  http://purl.uniprot.org/uniprot/Q8WUI4  http://rdf.rhea-db.org/58196   \n",
       "1  http://purl.uniprot.org/uniprot/Q8N5Y8  http://rdf.rhea-db.org/58220   \n",
       "2  http://purl.uniprot.org/uniprot/Q460N5  http://rdf.rhea-db.org/58224   \n",
       "3  http://purl.uniprot.org/uniprot/Q8N5Y8  http://rdf.rhea-db.org/58224   \n",
       "4  http://purl.uniprot.org/uniprot/Q9UKK3  http://rdf.rhea-db.org/58224   \n",
       "\n",
       "                                    reactionEquation  \n",
       "0  H2O + N(6)-acetyl-L-lysyl-[histone] = acetate ...  \n",
       "1  L-lysyl-[protein] + NAD(+) = H(+) + N(6)-(ADP-...  \n",
       "2  L-glutamyl-[protein] + NAD(+) = 5-O-(ADP-D-rib...  \n",
       "3  L-glutamyl-[protein] + NAD(+) = 5-O-(ADP-D-rib...  \n",
       "4  L-glutamyl-[protein] + NAD(+) = 5-O-(ADP-D-rib...  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df  = sparql2pandas(sparql_Q6,sparql_rhea_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q6')\n",
    "    stop\n",
    "    \n",
    "# Display the 5 first rows\n",
    "df.head(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q7: Ask if there are fungal UniProtKB/Swiss-Prot protein(s) metabolizing cholesterol (for QC)\n",
    "\n",
    "**ASK** query form returns a boolean indicating whether a query pattern matches or not.\n",
    "\n",
    "Expected answer: _False_\n",
    "\n",
    "Answer as Dec 2019: _True_  \n",
    "\n",
    "To-do: fix errors in UniProt entries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint: https://sparql.uniprot.org/sparql/\n",
      "\n",
      "PREFIX up:<http://purl.uniprot.org/core/>\n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
      "PREFIX ch:<http://purl.obolibrary.org/obo/>\n",
      "ASK {\n",
      "  SERVICE <https://sparql.rhea-db.org/sparql> {\n",
      "    ?reaction rdfs:subClassOf rh:Reaction .\n",
      "    ?reaction rh:status ?status .\n",
      "    VALUES (?status) {(rh:Approved) (rh:Preliminary)}\n",
      "    ?reaction rh:side ?reactionSide .\n",
      "    ?reactionSide rh:contains ?participant .\n",
      "    ?participant rh:compound ?compound .\n",
      "    # cholesterol: CHEBI:16113\n",
      "    ?compound rh:chebi ch:CHEBI_16113 .\n",
      "  }\n",
      "  ?reaction ^up:catalyzedReaction/^up:catalyticActivity/^up:annotation ?protein.\n",
      "  # fungi: NCBI taxid=4751\n",
      "  ?protein up:organism/rdfs:subClassOf taxon:4751 .\n",
      "  ?protein up:reviewed true .\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "sparql_Q7=\"\"\"\n",
    "#endpoint: https://sparql.uniprot.org/sparql/\n",
    "\n",
    "PREFIX up:<http://purl.uniprot.org/core/>\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
    "PREFIX ch:<http://purl.obolibrary.org/obo/>\n",
    "ASK {\n",
    "  SERVICE <https://sparql.rhea-db.org/sparql> {\n",
    "    ?reaction rdfs:subClassOf rh:Reaction .\n",
    "    ?reaction rh:status ?status .\n",
    "    VALUES (?status) {(rh:Approved) (rh:Preliminary)}\n",
    "    ?reaction rh:side ?reactionSide .\n",
    "    ?reactionSide rh:contains ?participant .\n",
    "    ?participant rh:compound ?compound .\n",
    "    # cholesterol: CHEBI:16113\n",
    "    ?compound rh:chebi ch:CHEBI_16113 .\n",
    "  }\n",
    "  ?reaction ^up:catalyzedReaction/^up:catalyticActivity/^up:annotation ?protein.\n",
    "  # fungi: NCBI taxid=4751\n",
    "  ?protein up:organism/rdfs:subClassOf taxon:4751 .\n",
    "  ?protein up:reviewed true .\n",
    "}\"\"\"\n",
    "\n",
    "print(sparql_Q7)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "True\n"
     ]
    }
   ],
   "source": [
    "# The result of a SPARQL query using ASK as query form is a boolean.\n",
    "# No need to convert in pandas dataframe!\n",
    "\n",
    "sparqlUniprot = SPARQLWrapper(sparql_uniprot_url)\n",
    "sparqlUniprot.setQuery(sparql_Q7)\n",
    "sparqlUniprot.setReturnFormat(JSON)\n",
    "results = sparqlUniprot.query().convert()\n",
    "\n",
    "print(results['boolean'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q8: Where are the human enzymes metabolizing cholesterol located in the cell?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint: https://sparql.uniprot.org/sparql/\n",
      "\n",
      "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#> \n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "PREFIX ch:<http://purl.obolibrary.org/obo/> \n",
      "PREFIX up:<http://purl.uniprot.org/core/>\n",
      "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
      "PREFIX skos:<http://www.w3.org/2004/02/skos/core#>\n",
      "\n",
      "SELECT distinct ?protein\n",
      "                ?reaction \n",
      "                ?upLocation \n",
      "                ?upLocationLabel \n",
      "                ?goId\n",
      "WHERE {\n",
      "  SERVICE <https://sparql.rhea-db.org/sparql> {\n",
      "    ?reaction rdfs:subClassOf rh:Reaction .\n",
      "    ?reaction rh:status rh:Approved .\n",
      "    ?reaction rh:equation ?reactionEquation .\n",
      "    ?reaction rh:side ?reactionSide .\n",
      "    ?reactionSide rh:contains ?participant .\n",
      "    ?participant rh:compound ?compound .\n",
      "    ?compound rh:chebi ch:CHEBI_16113 .\n",
      "  }\n",
      "  # Human proteins (taxid=9606)\n",
      "  ?protein up:organism taxon:9606 .\n",
      "  # Rhea catalayzed reactions\n",
      "  ?protein up:annotation ?a1 .\n",
      "  ?a1 a up:Catalytic_Activity_Annotation .\n",
      "  ?a1 up:catalyticActivity ?ca .\n",
      "  ?ca up:catalyzedReaction ?reaction .\n",
      "  # UniProt cellular components\n",
      "  ?protein up:annotation ?a2 .    \n",
      "  ?a2  a  up:Subcellular_Location_Annotation .    \n",
      "  ?a2 up:locatedIn ?lIn .\n",
      "  ?lIn up:cellularComponent ?upLocation .    \n",
      "  ?upLocation skos:prefLabel ?upLocationLabel  .    \n",
      "  ?upLocation skos:exactMatch ?goId .\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql_Q8=\"\"\"\n",
    "#endpoint: https://sparql.uniprot.org/sparql/\n",
    "\n",
    "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#> \n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "PREFIX ch:<http://purl.obolibrary.org/obo/> \n",
    "PREFIX up:<http://purl.uniprot.org/core/>\n",
    "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
    "PREFIX skos:<http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "SELECT distinct ?protein\n",
    "                ?reaction \n",
    "                ?upLocation \n",
    "                ?upLocationLabel \n",
    "                ?goId\n",
    "WHERE {\n",
    "  SERVICE <https://sparql.rhea-db.org/sparql> {\n",
    "    ?reaction rdfs:subClassOf rh:Reaction .\n",
    "    ?reaction rh:status rh:Approved .\n",
    "    ?reaction rh:equation ?reactionEquation .\n",
    "    ?reaction rh:side ?reactionSide .\n",
    "    ?reactionSide rh:contains ?participant .\n",
    "    ?participant rh:compound ?compound .\n",
    "    ?compound rh:chebi ch:CHEBI_16113 .\n",
    "  }\n",
    "  # Human proteins (taxid=9606)\n",
    "  ?protein up:organism taxon:9606 .\n",
    "  # Rhea catalayzed reactions\n",
    "  ?protein up:annotation ?a1 .\n",
    "  ?a1 a up:Catalytic_Activity_Annotation .\n",
    "  ?a1 up:catalyticActivity ?ca .\n",
    "  ?ca up:catalyzedReaction ?reaction .\n",
    "  # UniProt cellular components\n",
    "  ?protein up:annotation ?a2 .    \n",
    "  ?a2  a  up:Subcellular_Location_Annotation .    \n",
    "  ?a2 up:locatedIn ?lIn .\n",
    "  ?lIn up:cellularComponent ?upLocation .    \n",
    "  ?upLocation skos:prefLabel ?upLocationLabel  .    \n",
    "  ?upLocation skos:exactMatch ?goId .\n",
    "}\n",
    "\"\"\"\n",
    "print(sparql_Q8)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>goId</th>\n",
       "      <th>protein</th>\n",
       "      <th>reaction</th>\n",
       "      <th>upLocation</th>\n",
       "      <th>upLocationLabel</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0005768</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/O95477</td>\n",
       "      <td>http://rdf.rhea-db.org/39051</td>\n",
       "      <td>http://purl.uniprot.org/locations/101</td>\n",
       "      <td>Endosome</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000139</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/P45844</td>\n",
       "      <td>http://rdf.rhea-db.org/39051</td>\n",
       "      <td>http://purl.uniprot.org/locations/134</td>\n",
       "      <td>Golgi apparatus membrane</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000139</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q15392</td>\n",
       "      <td>http://rdf.rhea-db.org/36391</td>\n",
       "      <td>http://purl.uniprot.org/locations/134</td>\n",
       "      <td>Golgi apparatus membrane</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000139</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q9HCG7</td>\n",
       "      <td>http://rdf.rhea-db.org/11956</td>\n",
       "      <td>http://purl.uniprot.org/locations/134</td>\n",
       "      <td>Golgi apparatus membrane</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000139</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q9HCG7</td>\n",
       "      <td>http://rdf.rhea-db.org/58264</td>\n",
       "      <td>http://purl.uniprot.org/locations/134</td>\n",
       "      <td>Golgi apparatus membrane</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        goId  \\\n",
       "0  http://purl.obolibrary.org/obo/GO_0005768   \n",
       "1  http://purl.obolibrary.org/obo/GO_0000139   \n",
       "2  http://purl.obolibrary.org/obo/GO_0000139   \n",
       "3  http://purl.obolibrary.org/obo/GO_0000139   \n",
       "4  http://purl.obolibrary.org/obo/GO_0000139   \n",
       "\n",
       "                                  protein                      reaction  \\\n",
       "0  http://purl.uniprot.org/uniprot/O95477  http://rdf.rhea-db.org/39051   \n",
       "1  http://purl.uniprot.org/uniprot/P45844  http://rdf.rhea-db.org/39051   \n",
       "2  http://purl.uniprot.org/uniprot/Q15392  http://rdf.rhea-db.org/36391   \n",
       "3  http://purl.uniprot.org/uniprot/Q9HCG7  http://rdf.rhea-db.org/11956   \n",
       "4  http://purl.uniprot.org/uniprot/Q9HCG7  http://rdf.rhea-db.org/58264   \n",
       "\n",
       "                              upLocation           upLocationLabel  \n",
       "0  http://purl.uniprot.org/locations/101                  Endosome  \n",
       "1  http://purl.uniprot.org/locations/134  Golgi apparatus membrane  \n",
       "2  http://purl.uniprot.org/locations/134  Golgi apparatus membrane  \n",
       "3  http://purl.uniprot.org/locations/134  Golgi apparatus membrane  \n",
       "4  http://purl.uniprot.org/locations/134  Golgi apparatus membrane  "
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df  = sparql2pandas(sparql_Q8,sparql_uniprot_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q8')\n",
    "    stop\n",
    "    \n",
    "# Display the 5 first rows\n",
    "df.head(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q9: Where are the human genes encoding enzymes metabolizing cholesterol expressed?\n",
    "\n",
    "WARNING: this query may take a few minutes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint: https://sparql.uniprot.org/sparql/\n",
      "\n",
      "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "PREFIX ch:<http://purl.obolibrary.org/obo/> \n",
      "PREFIX up:<http://purl.uniprot.org/core/>\n",
      "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
      "PREFIX genex: <http://purl.org/genex#>\n",
      "PREFIX lscr: <http://purl.org/lscr#>\n",
      "\n",
      "SELECT distinct ?protein \n",
      "                ?ensemblGene \n",
      "                ?reaction \n",
      "                ?anatomicEntityLabel \n",
      "                ?anatomicEntity\n",
      "WHERE {\n",
      "  # federated query to Rhea enadpoint\n",
      "  {\n",
      "    SELECT * WHERE {\n",
      "      SERVICE <https://sparql.rhea-db.org/sparql> {\n",
      "        ?reaction rdfs:subClassOf rh:Reaction .\n",
      "        ?reaction rh:status rh:Approved .\n",
      "        ?reaction rh:equation ?reactionEquation .\n",
      "        ?reaction rh:side ?reactionSide .\n",
      "        ?reactionSide rh:contains ?participant .\n",
      "        ?participant rh:compound ?compound .\n",
      "        ?compound rh:chebi ch:CHEBI_16113 .\n",
      "      }\n",
      "    }\n",
      "  }\n",
      "  ?protein up:organism taxon:9606 .\n",
      "  ?protein up:annotation ?a .\n",
      "  ?a a up:Catalytic_Activity_Annotation .\n",
      "  ?a up:catalyticActivity ?ca .\n",
      "  ?ca up:catalyzedReaction ?reaction .\n",
      "  ?protein rdfs:seeAlso / up:transcribedFrom ?ensemblGene .\n",
      "  # federated query to biosoda Bgee\n",
      "  SERVICE <http://biosoda.expasy.org/rdf4j-server/repositories/bgeelight> {\n",
      "    ?gene genex:isExpressedIn ?anatomicEntity .\n",
      "    ?gene lscr:xrefEnsemblGene ?ensemblGene .\n",
      "    ?anatomicEntity rdfs:label ?anatomicEntityLabel .\n",
      "  }\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql_Q9=\"\"\"\n",
    "#endpoint: https://sparql.uniprot.org/sparql/\n",
    "\n",
    "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "PREFIX ch:<http://purl.obolibrary.org/obo/> \n",
    "PREFIX up:<http://purl.uniprot.org/core/>\n",
    "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
    "PREFIX genex: <http://purl.org/genex#>\n",
    "PREFIX lscr: <http://purl.org/lscr#>\n",
    "\n",
    "SELECT distinct ?protein \n",
    "                ?ensemblGene \n",
    "                ?reaction \n",
    "                ?anatomicEntityLabel \n",
    "                ?anatomicEntity\n",
    "WHERE {\n",
    "  # federated query to Rhea enadpoint\n",
    "  {\n",
    "    SELECT * WHERE {\n",
    "      SERVICE <https://sparql.rhea-db.org/sparql> {\n",
    "        ?reaction rdfs:subClassOf rh:Reaction .\n",
    "        ?reaction rh:status rh:Approved .\n",
    "        ?reaction rh:equation ?reactionEquation .\n",
    "        ?reaction rh:side ?reactionSide .\n",
    "        ?reactionSide rh:contains ?participant .\n",
    "        ?participant rh:compound ?compound .\n",
    "        ?compound rh:chebi ch:CHEBI_16113 .\n",
    "      }\n",
    "    }\n",
    "  }\n",
    "  ?protein up:organism taxon:9606 .\n",
    "  ?protein up:annotation ?a .\n",
    "  ?a a up:Catalytic_Activity_Annotation .\n",
    "  ?a up:catalyticActivity ?ca .\n",
    "  ?ca up:catalyzedReaction ?reaction .\n",
    "  ?protein rdfs:seeAlso / up:transcribedFrom ?ensemblGene .\n",
    "  # federated query to biosoda Bgee\n",
    "  SERVICE <http://biosoda.expasy.org/rdf4j-server/repositories/bgeelight> {\n",
    "    ?gene genex:isExpressedIn ?anatomicEntity .\n",
    "    ?gene lscr:xrefEnsemblGene ?ensemblGene .\n",
    "    ?anatomicEntity rdfs:label ?anatomicEntityLabel .\n",
    "  }\n",
    "}\n",
    "\"\"\"\n",
    "print(sparql_Q9)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>anatomicEntity</th>\n",
       "      <th>anatomicEntityLabel</th>\n",
       "      <th>ensemblGene</th>\n",
       "      <th>protein</th>\n",
       "      <th>reaction</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_0000015</td>\n",
       "      <td>male germ cell</td>\n",
       "      <td>http://rdf.ebi.ac.uk/resource/ensembl/ENSG0000...</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/O95477</td>\n",
       "      <td>http://rdf.rhea-db.org/39051</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_0000019</td>\n",
       "      <td>sperm</td>\n",
       "      <td>http://rdf.ebi.ac.uk/resource/ensembl/ENSG0000...</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/O95477</td>\n",
       "      <td>http://rdf.rhea-db.org/39051</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_0000023</td>\n",
       "      <td>oocyte</td>\n",
       "      <td>http://rdf.ebi.ac.uk/resource/ensembl/ENSG0000...</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/O95477</td>\n",
       "      <td>http://rdf.rhea-db.org/39051</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_0000083</td>\n",
       "      <td>epithelial cell of pancreas</td>\n",
       "      <td>http://rdf.ebi.ac.uk/resource/ensembl/ENSG0000...</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/O95477</td>\n",
       "      <td>http://rdf.rhea-db.org/39051</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CL_0000115</td>\n",
       "      <td>endothelial cell</td>\n",
       "      <td>http://rdf.ebi.ac.uk/resource/ensembl/ENSG0000...</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/O95477</td>\n",
       "      <td>http://rdf.rhea-db.org/39051</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                              anatomicEntity          anatomicEntityLabel  \\\n",
       "0  http://purl.obolibrary.org/obo/CL_0000015               male germ cell   \n",
       "1  http://purl.obolibrary.org/obo/CL_0000019                        sperm   \n",
       "2  http://purl.obolibrary.org/obo/CL_0000023                       oocyte   \n",
       "3  http://purl.obolibrary.org/obo/CL_0000083  epithelial cell of pancreas   \n",
       "4  http://purl.obolibrary.org/obo/CL_0000115             endothelial cell   \n",
       "\n",
       "                                         ensemblGene  \\\n",
       "0  http://rdf.ebi.ac.uk/resource/ensembl/ENSG0000...   \n",
       "1  http://rdf.ebi.ac.uk/resource/ensembl/ENSG0000...   \n",
       "2  http://rdf.ebi.ac.uk/resource/ensembl/ENSG0000...   \n",
       "3  http://rdf.ebi.ac.uk/resource/ensembl/ENSG0000...   \n",
       "4  http://rdf.ebi.ac.uk/resource/ensembl/ENSG0000...   \n",
       "\n",
       "                                  protein                      reaction  \n",
       "0  http://purl.uniprot.org/uniprot/O95477  http://rdf.rhea-db.org/39051  \n",
       "1  http://purl.uniprot.org/uniprot/O95477  http://rdf.rhea-db.org/39051  \n",
       "2  http://purl.uniprot.org/uniprot/O95477  http://rdf.rhea-db.org/39051  \n",
       "3  http://purl.uniprot.org/uniprot/O95477  http://rdf.rhea-db.org/39051  \n",
       "4  http://purl.uniprot.org/uniprot/O95477  http://rdf.rhea-db.org/39051  "
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df  = sparql2pandas(sparql_Q9,sparql_uniprot_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q9')\n",
    "    stop\n",
    "    \n",
    "# Display the 5 first rows\n",
    "df.head(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q10: Build the UniProt H. pylori proteome scale metabolic network"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint: https://sparql.rhea-db.org/sparql\n",
      "\n",
      "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "PREFIX up:<http://purl.uniprot.org/core/>\n",
      "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
      "SELECT  ?protein \n",
      "        ?proteinId\n",
      "        ?reaction \n",
      "        ?reactionSide \n",
      "        ?compound  \n",
      "        ?chebi \n",
      "        ?reactionEquation\n",
      "WHERE {\n",
      "  SERVICE <http://sparql.uniprot.org/sparql> {\n",
      "    ?protein up:reviewed ?status .\n",
      "    # Filter by NCBI taxid (H. pylori == 85962)\n",
      "    ?protein up:organism taxon:85962 .\n",
      "    ?protein up:mnemonic ?proteinId . \n",
      "    # Rhea reactions catalyzed by UniProt proteins\n",
      "    ?protein up:annotation ?a .\n",
      "    ?a up:catalyticActivity ?ca .\n",
      "    ?ca up:catalyzedReaction ?reaction .  \n",
      "  }\n",
      "  ?reaction rh:equation ?reactionEquation .\n",
      "  ?reaction rh:side ?reactionSide .\n",
      "  ?reactionSide rh:contains ?participant .\n",
      "  ?participant rh:compound ?compound .\n",
      "  OPTIONAL {?compound rh:chebi ?chebi } .\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql_Q10=\"\"\"\n",
    "#endpoint: https://sparql.rhea-db.org/sparql\n",
    "\n",
    "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "PREFIX up:<http://purl.uniprot.org/core/>\n",
    "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
    "SELECT  ?protein \n",
    "        ?proteinId\n",
    "        ?reaction \n",
    "        ?reactionSide \n",
    "        ?compound  \n",
    "        ?chebi \n",
    "        ?reactionEquation\n",
    "WHERE {\n",
    "  SERVICE <http://sparql.uniprot.org/sparql> {\n",
    "    ?protein up:reviewed ?status .\n",
    "    # Filter by NCBI taxid (H. pylori == 85962)\n",
    "    ?protein up:organism taxon:85962 .\n",
    "    ?protein up:mnemonic ?proteinId . \n",
    "    # Rhea reactions catalyzed by UniProt proteins\n",
    "    ?protein up:annotation ?a .\n",
    "    ?a up:catalyticActivity ?ca .\n",
    "    ?ca up:catalyzedReaction ?reaction .  \n",
    "  }\n",
    "  ?reaction rh:equation ?reactionEquation .\n",
    "  ?reaction rh:side ?reactionSide .\n",
    "  ?reactionSide rh:contains ?participant .\n",
    "  ?participant rh:compound ?compound .\n",
    "  OPTIONAL {?compound rh:chebi ?chebi } .\n",
    "}\n",
    "\"\"\"\n",
    "print(sparql_Q10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>chebi</th>\n",
       "      <th>compound</th>\n",
       "      <th>protein</th>\n",
       "      <th>proteinId</th>\n",
       "      <th>reaction</th>\n",
       "      <th>reactionEquation</th>\n",
       "      <th>reactionSide</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_26386</td>\n",
       "      <td>http://rdf.rhea-db.org/Compound_14976</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/P56463</td>\n",
       "      <td>DEOD_HELPY</td>\n",
       "      <td>http://rdf.rhea-db.org/36431</td>\n",
       "      <td>a purine 2'-deoxy-D-ribonucleoside + phosphate...</td>\n",
       "      <td>http://rdf.rhea-db.org/36431_R</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_142361</td>\n",
       "      <td>http://rdf.rhea-db.org/Compound_15011</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/P56463</td>\n",
       "      <td>DEOD_HELPY</td>\n",
       "      <td>http://rdf.rhea-db.org/36431</td>\n",
       "      <td>a purine 2'-deoxy-D-ribonucleoside + phosphate...</td>\n",
       "      <td>http://rdf.rhea-db.org/36431_L</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_83905</td>\n",
       "      <td>http://rdf.rhea-db.org/Compound_10767</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/O26027</td>\n",
       "      <td>MURE_HELPY</td>\n",
       "      <td>http://rdf.rhea-db.org/23676</td>\n",
       "      <td>ATP + meso-2,6-diaminopimelate + UDP-N-acetyl-...</td>\n",
       "      <td>http://rdf.rhea-db.org/23676_R</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_85987</td>\n",
       "      <td>http://rdf.rhea-db.org/Compound_11525</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/O25016</td>\n",
       "      <td>KDSB_HELPY</td>\n",
       "      <td>http://rdf.rhea-db.org/23448</td>\n",
       "      <td>3-deoxy-alpha-D-manno-oct-2-ulosonate + CTP = ...</td>\n",
       "      <td>http://rdf.rhea-db.org/23448_R</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/CHEBI_85987</td>\n",
       "      <td>http://rdf.rhea-db.org/Compound_11525</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/O25611</td>\n",
       "      <td>O25611_HELPY</td>\n",
       "      <td>http://rdf.rhea-db.org/28066</td>\n",
       "      <td>CMP-3-deoxy-beta-D-manno-octulosonate + lipid ...</td>\n",
       "      <td>http://rdf.rhea-db.org/28066_L</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         chebi  \\\n",
       "0   http://purl.obolibrary.org/obo/CHEBI_26386   \n",
       "1  http://purl.obolibrary.org/obo/CHEBI_142361   \n",
       "2   http://purl.obolibrary.org/obo/CHEBI_83905   \n",
       "3   http://purl.obolibrary.org/obo/CHEBI_85987   \n",
       "4   http://purl.obolibrary.org/obo/CHEBI_85987   \n",
       "\n",
       "                                compound  \\\n",
       "0  http://rdf.rhea-db.org/Compound_14976   \n",
       "1  http://rdf.rhea-db.org/Compound_15011   \n",
       "2  http://rdf.rhea-db.org/Compound_10767   \n",
       "3  http://rdf.rhea-db.org/Compound_11525   \n",
       "4  http://rdf.rhea-db.org/Compound_11525   \n",
       "\n",
       "                                  protein     proteinId  \\\n",
       "0  http://purl.uniprot.org/uniprot/P56463    DEOD_HELPY   \n",
       "1  http://purl.uniprot.org/uniprot/P56463    DEOD_HELPY   \n",
       "2  http://purl.uniprot.org/uniprot/O26027    MURE_HELPY   \n",
       "3  http://purl.uniprot.org/uniprot/O25016    KDSB_HELPY   \n",
       "4  http://purl.uniprot.org/uniprot/O25611  O25611_HELPY   \n",
       "\n",
       "                       reaction  \\\n",
       "0  http://rdf.rhea-db.org/36431   \n",
       "1  http://rdf.rhea-db.org/36431   \n",
       "2  http://rdf.rhea-db.org/23676   \n",
       "3  http://rdf.rhea-db.org/23448   \n",
       "4  http://rdf.rhea-db.org/28066   \n",
       "\n",
       "                                    reactionEquation  \\\n",
       "0  a purine 2'-deoxy-D-ribonucleoside + phosphate...   \n",
       "1  a purine 2'-deoxy-D-ribonucleoside + phosphate...   \n",
       "2  ATP + meso-2,6-diaminopimelate + UDP-N-acetyl-...   \n",
       "3  3-deoxy-alpha-D-manno-oct-2-ulosonate + CTP = ...   \n",
       "4  CMP-3-deoxy-beta-D-manno-octulosonate + lipid ...   \n",
       "\n",
       "                     reactionSide  \n",
       "0  http://rdf.rhea-db.org/36431_R  \n",
       "1  http://rdf.rhea-db.org/36431_L  \n",
       "2  http://rdf.rhea-db.org/23676_R  \n",
       "3  http://rdf.rhea-db.org/23448_R  \n",
       "4  http://rdf.rhea-db.org/28066_L  "
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df  = sparql2pandas(sparql_Q10,sparql_rhea_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q10')\n",
    "    stop\n",
    "    \n",
    "# Display the 5 first rows\n",
    "df.head(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q11: Explore H. pylori tryptophan biosynthesis pathway (GO:0000162)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint: https://sparql.uniprot.org/sparql/\n",
      "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#> \n",
      "PREFIX up:<http://purl.uniprot.org/core/>\n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
      "PREFIX ch:<http://purl.obolibrary.org/obo/>\n",
      "PREFIX GO:<http://purl.obolibrary.org/obo/GO_>\n",
      "SELECT distinct ?upProteinId \n",
      "                ?goId \n",
      "                ?rhReaction \n",
      "                ?upPathway \n",
      "WHERE{\n",
      "  ?upProtein up:reviewed true .\n",
      "  ?upProtein up:mnemonic  ?upProteinId . \n",
      "  # HELPY proteins (taxid=85962)\n",
      "  ?upProtein up:organism taxon:85962 .\n",
      "  ?upProtein up:annotation/up:catalyticActivity/up:catalyzedReaction ?rhReaction .  \n",
      "  ?upProtein up:classifiedWith ?goId .\n",
      "  VALUES ?goId {GO:0000162} # GO: tryptophan biosynthesis\n",
      "  OPTIONAL {?upProtein up:annotation ?pa . # Pathway annotation\n",
      "                      ?pa a up:Pathway_Annotation .  \n",
      "                      ?pa rdfs:seeAlso/rdfs:label ?upPathway . }\n",
      "}\n",
      "ORDER BY ?upPathway \n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql_Q11=\"\"\"\n",
    "#endpoint: https://sparql.uniprot.org/sparql/\n",
    "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#> \n",
    "PREFIX up:<http://purl.uniprot.org/core/>\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
    "PREFIX ch:<http://purl.obolibrary.org/obo/>\n",
    "PREFIX GO:<http://purl.obolibrary.org/obo/GO_>\n",
    "SELECT distinct ?upProteinId \n",
    "                ?goId \n",
    "                ?rhReaction \n",
    "                ?upPathway \n",
    "WHERE{\n",
    "  ?upProtein up:reviewed true .\n",
    "  ?upProtein up:mnemonic  ?upProteinId . \n",
    "  # HELPY proteins (taxid=85962)\n",
    "  ?upProtein up:organism taxon:85962 .\n",
    "  ?upProtein up:annotation/up:catalyticActivity/up:catalyzedReaction ?rhReaction .  \n",
    "  ?upProtein up:classifiedWith ?goId .\n",
    "  VALUES ?goId {GO:0000162} # GO: tryptophan biosynthesis\n",
    "  OPTIONAL {?upProtein up:annotation ?pa . # Pathway annotation\n",
    "                      ?pa a up:Pathway_Annotation .  \n",
    "                      ?pa rdfs:seeAlso/rdfs:label ?upPathway . }\n",
    "}\n",
    "ORDER BY ?upPathway \n",
    "\"\"\"\n",
    "print(sparql_Q11)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>goId</th>\n",
       "      <th>rhReaction</th>\n",
       "      <th>upPathway</th>\n",
       "      <th>upProteinId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000162</td>\n",
       "      <td>http://rdf.rhea-db.org/11768</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPD_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000162</td>\n",
       "      <td>http://rdf.rhea-db.org/10532</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPB_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000162</td>\n",
       "      <td>http://rdf.rhea-db.org/10532</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPA_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000162</td>\n",
       "      <td>http://rdf.rhea-db.org/23476</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPC_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000162</td>\n",
       "      <td>http://rdf.rhea-db.org/21540</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPC_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000162</td>\n",
       "      <td>http://rdf.rhea-db.org/21540</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPC_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000162</td>\n",
       "      <td>http://rdf.rhea-db.org/23476</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPC_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000162</td>\n",
       "      <td>http://rdf.rhea-db.org/21732</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPE_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://purl.obolibrary.org/obo/GO_0000162</td>\n",
       "      <td>http://rdf.rhea-db.org/21732</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPG_HELPY</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        goId                    rhReaction  \\\n",
       "0  http://purl.obolibrary.org/obo/GO_0000162  http://rdf.rhea-db.org/11768   \n",
       "1  http://purl.obolibrary.org/obo/GO_0000162  http://rdf.rhea-db.org/10532   \n",
       "2  http://purl.obolibrary.org/obo/GO_0000162  http://rdf.rhea-db.org/10532   \n",
       "3  http://purl.obolibrary.org/obo/GO_0000162  http://rdf.rhea-db.org/23476   \n",
       "4  http://purl.obolibrary.org/obo/GO_0000162  http://rdf.rhea-db.org/21540   \n",
       "5  http://purl.obolibrary.org/obo/GO_0000162  http://rdf.rhea-db.org/21540   \n",
       "6  http://purl.obolibrary.org/obo/GO_0000162  http://rdf.rhea-db.org/23476   \n",
       "7  http://purl.obolibrary.org/obo/GO_0000162  http://rdf.rhea-db.org/21732   \n",
       "8  http://purl.obolibrary.org/obo/GO_0000162  http://rdf.rhea-db.org/21732   \n",
       "\n",
       "                                           upPathway upProteinId  \n",
       "0  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPD_HELPY  \n",
       "1  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPB_HELPY  \n",
       "2  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPA_HELPY  \n",
       "3  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPC_HELPY  \n",
       "4  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPC_HELPY  \n",
       "5  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPC_HELPY  \n",
       "6  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPC_HELPY  \n",
       "7  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPE_HELPY  \n",
       "8  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPG_HELPY  "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df  = sparql2pandas(sparql_Q11,sparql_uniprot_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q11')\n",
    "    \n",
    "# Display all results\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Q12: H. pylori enzyme complexes for tryptophan biosynthesis pathway (MetaNetX: seed_Opt85962_1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint: https://sparql.uniprot.org/sparql/\n",
      "\n",
      "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX up:<http://purl.uniprot.org/core/>\n",
      "PREFIX rh:<http://rdf.rhea-db.org/>\n",
      "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
      "PREFIX mnx:<https://rdf.metanetx.org/schema/>\n",
      "PREFIX mnet:<https://rdf.metanetx.org/mnet/>\n",
      "PREFIX GO:<http://purl.obolibrary.org/obo/GO_>\n",
      "\n",
      "SELECT distinct\n",
      "    ?upPathway\n",
      "    ?upProteinId\n",
      "    ?rhReaction\n",
      "    ?mnxr\n",
      "    ?cplx_label\n",
      "    ?mnet\n",
      "WHERE{\n",
      "    ?upProtein up:reviewed true .\n",
      "    ?upProtein up:mnemonic ?upProteinId .\n",
      "    ?upProtein up:organism taxon:85962 .\n",
      "    ?upProtein up:classifiedWith GO:0000162.\n",
      "    ?upProtein up:annotation/up:catalyticActivity/up:catalyzedReaction ?rhReaction .\n",
      "    # Pathway annotation\n",
      "    OPTIONAL {?upProtein up:annotation ?pa           . \n",
      "              ?pa a up:Pathway_Annotation            ;  \n",
      "                  rdfs:seeAlso/rdfs:label ?upPathway . }\n",
      "    SERVICE <https://rdf.metanetx.org/sparql> {\n",
      "        ?mnxr mnx:reacXref ?rhReaction .\n",
      "        ?reac mnx:mnxr     ?mnxr       .\n",
      "        ?gpr  mnx:reac     ?reac       ;\n",
      "              mnx:cata     ?cata       .\n",
      "        ?cata mnx:cplx     ?cplx       .\n",
      "        ?cplx rdfs:label   ?cplx_label .\n",
      "        ?mnet mnx:gpr      ?gpr        .\n",
      "        VALUES ?mnet {mnet:seed_Opt85962_1}\n",
      "    }\n",
      "}\n",
      "ORDER BY ?upPathway\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql_Q12=\"\"\"\n",
    "#endpoint: https://sparql.uniprot.org/sparql/\n",
    "\n",
    "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX up:<http://purl.uniprot.org/core/>\n",
    "PREFIX rh:<http://rdf.rhea-db.org/>\n",
    "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
    "PREFIX mnx:<https://rdf.metanetx.org/schema/>\n",
    "PREFIX mnet:<https://rdf.metanetx.org/mnet/>\n",
    "PREFIX GO:<http://purl.obolibrary.org/obo/GO_>\n",
    "\n",
    "SELECT distinct\n",
    "    ?upPathway\n",
    "    ?upProteinId\n",
    "    ?rhReaction\n",
    "    ?mnxr\n",
    "    ?cplx_label\n",
    "    ?mnet\n",
    "WHERE{\n",
    "    ?upProtein up:reviewed true .\n",
    "    ?upProtein up:mnemonic ?upProteinId .\n",
    "    ?upProtein up:organism taxon:85962 .\n",
    "    ?upProtein up:classifiedWith GO:0000162.\n",
    "    ?upProtein up:annotation/up:catalyticActivity/up:catalyzedReaction ?rhReaction .\n",
    "    # Pathway annotation\n",
    "    OPTIONAL {?upProtein up:annotation ?pa           . \n",
    "              ?pa a up:Pathway_Annotation            ;  \n",
    "                  rdfs:seeAlso/rdfs:label ?upPathway . }\n",
    "    SERVICE <https://rdf.metanetx.org/sparql> {\n",
    "        ?mnxr mnx:reacXref ?rhReaction .\n",
    "        ?reac mnx:mnxr     ?mnxr       .\n",
    "        ?gpr  mnx:reac     ?reac       ;\n",
    "              mnx:cata     ?cata       .\n",
    "        ?cata mnx:cplx     ?cplx       .\n",
    "        ?cplx rdfs:label   ?cplx_label .\n",
    "        ?mnet mnx:gpr      ?gpr        .\n",
    "        VALUES ?mnet {mnet:seed_Opt85962_1}\n",
    "    }\n",
    "}\n",
    "ORDER BY ?upPathway\n",
    "\"\"\"\n",
    "print(sparql_Q12)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>cplx_label</th>\n",
       "      <th>mnet</th>\n",
       "      <th>mnxr</th>\n",
       "      <th>rhReaction</th>\n",
       "      <th>upPathway</th>\n",
       "      <th>upProteinId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>bact:TRPD_HELPY</td>\n",
       "      <td>https://rdf.metanetx.org/mnet/seed_Opt85962_1</td>\n",
       "      <td>https://rdf.metanetx.org/reac/MNXR95842</td>\n",
       "      <td>http://rdf.rhea-db.org/11768</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPD_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>bact:TRPA_HELPY+bact:TRPB_HELPY</td>\n",
       "      <td>https://rdf.metanetx.org/mnet/seed_Opt85962_1</td>\n",
       "      <td>https://rdf.metanetx.org/reac/MNXR104343</td>\n",
       "      <td>http://rdf.rhea-db.org/10532</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPB_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>bact:TRPA_HELPY+bact:TRPB_HELPY</td>\n",
       "      <td>https://rdf.metanetx.org/mnet/seed_Opt85962_1</td>\n",
       "      <td>https://rdf.metanetx.org/reac/MNXR104343</td>\n",
       "      <td>http://rdf.rhea-db.org/10532</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPA_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>bact:TRPC_HELPY</td>\n",
       "      <td>https://rdf.metanetx.org/mnet/seed_Opt85962_1</td>\n",
       "      <td>https://rdf.metanetx.org/reac/MNXR100814</td>\n",
       "      <td>http://rdf.rhea-db.org/23476</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPC_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>bact:TRPC_HELPY</td>\n",
       "      <td>https://rdf.metanetx.org/mnet/seed_Opt85962_1</td>\n",
       "      <td>https://rdf.metanetx.org/reac/MNXR103156</td>\n",
       "      <td>http://rdf.rhea-db.org/21540</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPC_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>bact:TRPC_HELPY</td>\n",
       "      <td>https://rdf.metanetx.org/mnet/seed_Opt85962_1</td>\n",
       "      <td>https://rdf.metanetx.org/reac/MNXR103156</td>\n",
       "      <td>http://rdf.rhea-db.org/21540</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPC_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>bact:TRPC_HELPY</td>\n",
       "      <td>https://rdf.metanetx.org/mnet/seed_Opt85962_1</td>\n",
       "      <td>https://rdf.metanetx.org/reac/MNXR100814</td>\n",
       "      <td>http://rdf.rhea-db.org/23476</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPC_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>bact:TRPE_HELPY+bact:TRPG_HELPY</td>\n",
       "      <td>https://rdf.metanetx.org/mnet/seed_Opt85962_1</td>\n",
       "      <td>https://rdf.metanetx.org/reac/MNXR95843</td>\n",
       "      <td>http://rdf.rhea-db.org/21732</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPE_HELPY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>bact:TRPE_HELPY+bact:TRPG_HELPY</td>\n",
       "      <td>https://rdf.metanetx.org/mnet/seed_Opt85962_1</td>\n",
       "      <td>https://rdf.metanetx.org/reac/MNXR95843</td>\n",
       "      <td>http://rdf.rhea-db.org/21732</td>\n",
       "      <td>Amino-acid biosynthesis; L-tryptophan biosynth...</td>\n",
       "      <td>TRPG_HELPY</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        cplx_label  \\\n",
       "0                  bact:TRPD_HELPY   \n",
       "1  bact:TRPA_HELPY+bact:TRPB_HELPY   \n",
       "2  bact:TRPA_HELPY+bact:TRPB_HELPY   \n",
       "3                  bact:TRPC_HELPY   \n",
       "4                  bact:TRPC_HELPY   \n",
       "5                  bact:TRPC_HELPY   \n",
       "6                  bact:TRPC_HELPY   \n",
       "7  bact:TRPE_HELPY+bact:TRPG_HELPY   \n",
       "8  bact:TRPE_HELPY+bact:TRPG_HELPY   \n",
       "\n",
       "                                            mnet  \\\n",
       "0  https://rdf.metanetx.org/mnet/seed_Opt85962_1   \n",
       "1  https://rdf.metanetx.org/mnet/seed_Opt85962_1   \n",
       "2  https://rdf.metanetx.org/mnet/seed_Opt85962_1   \n",
       "3  https://rdf.metanetx.org/mnet/seed_Opt85962_1   \n",
       "4  https://rdf.metanetx.org/mnet/seed_Opt85962_1   \n",
       "5  https://rdf.metanetx.org/mnet/seed_Opt85962_1   \n",
       "6  https://rdf.metanetx.org/mnet/seed_Opt85962_1   \n",
       "7  https://rdf.metanetx.org/mnet/seed_Opt85962_1   \n",
       "8  https://rdf.metanetx.org/mnet/seed_Opt85962_1   \n",
       "\n",
       "                                       mnxr                    rhReaction  \\\n",
       "0   https://rdf.metanetx.org/reac/MNXR95842  http://rdf.rhea-db.org/11768   \n",
       "1  https://rdf.metanetx.org/reac/MNXR104343  http://rdf.rhea-db.org/10532   \n",
       "2  https://rdf.metanetx.org/reac/MNXR104343  http://rdf.rhea-db.org/10532   \n",
       "3  https://rdf.metanetx.org/reac/MNXR100814  http://rdf.rhea-db.org/23476   \n",
       "4  https://rdf.metanetx.org/reac/MNXR103156  http://rdf.rhea-db.org/21540   \n",
       "5  https://rdf.metanetx.org/reac/MNXR103156  http://rdf.rhea-db.org/21540   \n",
       "6  https://rdf.metanetx.org/reac/MNXR100814  http://rdf.rhea-db.org/23476   \n",
       "7   https://rdf.metanetx.org/reac/MNXR95843  http://rdf.rhea-db.org/21732   \n",
       "8   https://rdf.metanetx.org/reac/MNXR95843  http://rdf.rhea-db.org/21732   \n",
       "\n",
       "                                           upPathway upProteinId  \n",
       "0  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPD_HELPY  \n",
       "1  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPB_HELPY  \n",
       "2  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPA_HELPY  \n",
       "3  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPC_HELPY  \n",
       "4  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPC_HELPY  \n",
       "5  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPC_HELPY  \n",
       "6  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPC_HELPY  \n",
       "7  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPE_HELPY  \n",
       "8  Amino-acid biosynthesis; L-tryptophan biosynth...  TRPG_HELPY  "
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df  = sparql2pandas(sparql_Q12,sparql_uniprot_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q12')\n",
    "    \n",
    "# Display all results\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Visualization"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Venn diagram showing the taxonomic distribution of Rhea reactions annotated in UniProtKB/Swiss-Prot (UniProtKB/Swiss-Prot)\n",
    "\n",
    "|Taxonomic domain name | NCBI taxid |\n",
    "|----------------------|------------|\n",
    "| Archaea | 2157 |\n",
    "| Bacteria | 2 |\n",
    "| Eukaryota | 2759 |\n",
    "| Viruses | 10239 | \n",
    "\n",
    "\n",
    "WARNING: the SPARQL query may take a few minutes\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q20: Retrieve UniProtKB/Swiss-Prot proteins, their taxonomic domain and their catalyzed Rhea reactions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "#endpoint: https://sparql.uniprot.org/sparql/\n",
      "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#> \n",
      "PREFIX up:<http://purl.uniprot.org/core/>\n",
      "PREFIX keywords:<http://purl.uniprot.org/keywords/>\n",
      "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
      "\n",
      "SELECT distinct ?upProtein  \n",
      "                ?taxid\n",
      "                ?domain\n",
      "                ?domainName\n",
      "                ?rhReaction\n",
      "WHERE {\n",
      "  # UniProtKB/Swiss-Prot entries (reviewed)\n",
      "  ?upProtein up:reviewed true .\n",
      "  # \n",
      "  ?upProtein up:organism ?taxid .\n",
      "  ?taxid rdfs:subClassOf ?domain .\n",
      "  VALUES (?domain) { (taxon:2157) (taxon:2) (taxon:2759) (taxon:10239)} \n",
      "  ?domain up:scientificName ?domainName .\n",
      "  ?upProtein up:annotation/up:catalyticActivity/up:catalyzedReaction ?rhReaction .\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql_Q20=\"\"\"\n",
    "#endpoint: https://sparql.uniprot.org/sparql/\n",
    "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#> \n",
    "PREFIX up:<http://purl.uniprot.org/core/>\n",
    "PREFIX keywords:<http://purl.uniprot.org/keywords/>\n",
    "PREFIX taxon:<http://purl.uniprot.org/taxonomy/>\n",
    "\n",
    "SELECT distinct ?upProtein  \n",
    "                ?taxid\n",
    "                ?domain\n",
    "                ?domainName\n",
    "                ?rhReaction\n",
    "WHERE {\n",
    "  # UniProtKB/Swiss-Prot entries (reviewed)\n",
    "  ?upProtein up:reviewed true .\n",
    "  # \n",
    "  ?upProtein up:organism ?taxid .\n",
    "  ?taxid rdfs:subClassOf ?domain .\n",
    "  VALUES (?domain) { (taxon:2157) (taxon:2) (taxon:2759) (taxon:10239)} \n",
    "  ?domain up:scientificName ?domainName .\n",
    "  ?upProtein up:annotation/up:catalyticActivity/up:catalyzedReaction ?rhReaction .\n",
    "}\n",
    "\"\"\"\n",
    "    \n",
    "print(sparql_Q20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>domain</th>\n",
       "      <th>domainName</th>\n",
       "      <th>rhReaction</th>\n",
       "      <th>taxid</th>\n",
       "      <th>upProtein</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.uniprot.org/taxonomy/2</td>\n",
       "      <td>Bacteria</td>\n",
       "      <td>http://rdf.rhea-db.org/21708</td>\n",
       "      <td>http://purl.uniprot.org/taxonomy/29448</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/A0A087WNH6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.uniprot.org/taxonomy/2157</td>\n",
       "      <td>Archaea</td>\n",
       "      <td>http://rdf.rhea-db.org/24836</td>\n",
       "      <td>http://purl.uniprot.org/taxonomy/188937</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q8TU67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.uniprot.org/taxonomy/2157</td>\n",
       "      <td>Archaea</td>\n",
       "      <td>http://rdf.rhea-db.org/55204</td>\n",
       "      <td>http://purl.uniprot.org/taxonomy/187420</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/O27266</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.uniprot.org/taxonomy/2157</td>\n",
       "      <td>Archaea</td>\n",
       "      <td>http://rdf.rhea-db.org/42408</td>\n",
       "      <td>http://purl.uniprot.org/taxonomy/186497</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q8U4K7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.uniprot.org/taxonomy/2157</td>\n",
       "      <td>Archaea</td>\n",
       "      <td>http://rdf.rhea-db.org/23404</td>\n",
       "      <td>http://purl.uniprot.org/taxonomy/186497</td>\n",
       "      <td>http://purl.uniprot.org/uniprot/Q8U213</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  domain domainName  \\\n",
       "0     http://purl.uniprot.org/taxonomy/2   Bacteria   \n",
       "1  http://purl.uniprot.org/taxonomy/2157    Archaea   \n",
       "2  http://purl.uniprot.org/taxonomy/2157    Archaea   \n",
       "3  http://purl.uniprot.org/taxonomy/2157    Archaea   \n",
       "4  http://purl.uniprot.org/taxonomy/2157    Archaea   \n",
       "\n",
       "                     rhReaction                                    taxid  \\\n",
       "0  http://rdf.rhea-db.org/21708   http://purl.uniprot.org/taxonomy/29448   \n",
       "1  http://rdf.rhea-db.org/24836  http://purl.uniprot.org/taxonomy/188937   \n",
       "2  http://rdf.rhea-db.org/55204  http://purl.uniprot.org/taxonomy/187420   \n",
       "3  http://rdf.rhea-db.org/42408  http://purl.uniprot.org/taxonomy/186497   \n",
       "4  http://rdf.rhea-db.org/23404  http://purl.uniprot.org/taxonomy/186497   \n",
       "\n",
       "                                    upProtein  \n",
       "0  http://purl.uniprot.org/uniprot/A0A087WNH6  \n",
       "1      http://purl.uniprot.org/uniprot/Q8TU67  \n",
       "2      http://purl.uniprot.org/uniprot/O27266  \n",
       "3      http://purl.uniprot.org/uniprot/Q8U4K7  \n",
       "4      http://purl.uniprot.org/uniprot/Q8U213  "
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "try:\n",
    "    df_up_rh  = sparql2pandas(sparql_Q20,sparql_uniprot_url)\n",
    "except Exception:\n",
    "    print('ERROR in SPARQL query Q20')\n",
    "    \n",
    "# Display all results\n",
    "df_up_rh.head(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Compute Venn diagram using matplotlib and matplotlib_venn python libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "ename": "ModuleNotFoundError",
     "evalue": "No module named 'matplotlib_venn'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mModuleNotFoundError\u001b[0m                       Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-33-b87a0bf3186a>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mmatplotlib\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpyplot\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mplt\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 2\u001b[0;31m \u001b[0;32mfrom\u001b[0m \u001b[0mmatplotlib_venn\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mvenn3\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      3\u001b[0m \u001b[0;32mfrom\u001b[0m \u001b[0mmatplotlib_venn\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mvenn3_circles\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      4\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      5\u001b[0m \u001b[0mset_A\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mset\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdf_up_rh\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0mdf_up_rh\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdomainName\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34m'Archaea'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'rhReaction'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdrop_duplicates\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mModuleNotFoundError\u001b[0m: No module named 'matplotlib_venn'"
     ]
    }
   ],
   "source": [
    "import matplotlib.pyplot as plt\n",
    "from matplotlib_venn import venn3\n",
    "from matplotlib_venn import venn3_circles\n",
    "\n",
    "set_A = set(df_up_rh[df_up_rh.domainName == 'Archaea']['rhReaction'].drop_duplicates())\n",
    "set_B = set(df_up_rh[df_up_rh.domainName == 'Bacteria']['rhReaction'].drop_duplicates())\n",
    "set_E = set(df_up_rh[df_up_rh.domainName == 'Eukaryota']['rhReaction'].drop_duplicates())\n",
    "\n",
    "nb_A = len(set_A)\n",
    "nb_B = len(set_B)\n",
    "nb_E = len(set_E)\n",
    "nb_all = len(set_A | set_B | set_E)\n",
    "\n",
    "title = 'Taxonomic distribution of the Rhea reactions annotated in UniProtKB/Swiss-Prot\\n'\n",
    "title += 'Rhea reactions: in Archaea=%s ; in Bacteria=%s; in Eukaryota=%s\\n' % (nb_A, nb_B, nb_E)\n",
    "\n",
    "# Plot Venn diagram\n",
    "v=venn3([set_B,set_E,set_A], set_labels = ('Bacteria','Eukaryota', '\\nArchaea'))\n",
    "c=venn3_circles([set_B,set_E,set_A], linestyle='dashed', linewidth=1, color=\"grey\")\n",
    "plt.title(title)\n",
    "\n",
    "plt.show();"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "hide_input": false,
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": true,
   "toc_position": {
    "height": "636.667px",
    "left": "166px",
    "top": "109.722px",
    "width": "195.938px"
   },
   "toc_section_display": true,
   "toc_window_display": true
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
